The light source cannot be deleted with UI.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId ProhibitDeletionLightSource { get; }
  Visual Basic
Public Shared ReadOnly Property ProhibitDeletionLightSource As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ ProhibitDeletionLightSource {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures RenderFailures Class
  Autodesk.Revit.DB Namespace